Repository: helsingborg-stad/varnish-http-purge
Catalog: languages/varnish-http-purge-*.po
Languages: sv_se

source: Varnish cache emptied!
sv_se: Sidcachen har tömts!

source: Varnish HTTP Purge requires you to use custom permalinks. Please go to the <a href="%1$s">Permalinks Options Page</a> to configure them.
sv_se: Varnish HTTP Purge kräver att du använder permalänkar. Vänligen gå till <a href="%1$s">inställningssidan för permalänkar</a> och konfigurera dem.

source: Varnish HTTP Purge requires WordPress 4.7 or greater. Please <a href="%1$s">upgrade WordPress</a>.
sv_se: Varnish HTTP Purge kräver WordPress 4.7 eller högre. Vänligen <a href="%1$s">uppgradera WordPress</a>.

source: Empty Cache
sv_se: Töm cachefiler

source: <a href="%1$s">Varnish HTTP Purge</a> automatically deletes your cached posts when published or updated. When making major site changes, such as with a new theme, plugins, or widgets, you may need to manually empty the cache.
sv_se: <a href="%1$s">Varnish HTTP Purge</a> raderar automatiskt cachade inlägg när de publiceras eller uppdateras. När du gör större förändringar på din webbplats så som att välja ett nytt tema, installerar ett plugin eller widgets kan du behöva tömma din cache.

source: Press the button below to force it to empty your entire Varnish cache.
sv_se: Klicka på knappen för att manuellt tömma hela Varnish cache.

source: You do not have permission to empty the Varnish cache for the whole site. Please contact your administrator.
sv_se: Du har inte tillräckliga behörigheter för att tömma Varnish cache för hela webbplatsen. Vänligen kontakta administratören.

source: Is Varnish Working?
sv_se: Fungerar Varnish?

source: Check Varnish Status
sv_se: Kontrollera Varnish status

source: Check A URL On Your Site:
sv_se: Kontrollera en URL på din webbplats:

source: Configure Custom Varnish IP
sv_se: Konfigurera Varnish IP

source: Set Varnish IP
sv_se: Ställ in Varnish IP-adress

source: The majority of users will never need to so much as look down here. However there are cases when a custom Varnish IP Address will need to be set, in order to tell the plugin to empty the cache in a specific location. If you're using a CDN like Cloudflare or a Firewall Proxy like Sucuri, you will want to set this.
sv_se: Majoriteten av användarna behöver inte konfigurera mer. I vissa fall måste dock ett Varnish IP ställas in, för att pluginet ska veta vilken cache-server som ska tömmas. Om du använder ett CDN så som Cloudflare eller en Brandväggsproxy så som Sucuri vill du ställa in detta.

source: Your Varnish IP the IP address of the server where Varnish is installed. Your Varnish IP must be one of the IPs that Varnish is listening. If you use multiple IPs, or if you've customized your ACLs, you'll need to pick one that doesn't conflict with your other settings. For example, if you have Varnish listening on a public and private IP, pick the private. On the other hand, if you told Varnish to listen on 0.0.0.0 (i.e. "listen on every interface you can") you would need to check what IP you set your purge ACL to allow (commonly 127.0.0.1 aka localhost), and use that (i.e. 127.0.0.1).
sv_se: Den IP-adress som Varnish svarar på. Om du använder flera IP-adresser bör du välja en som inte servar andra tjänster. Till exempel: Om servern svarar på både ett privat ip och ett publikt ip bör du välja det privata. Om du däremot har tillåtit alla ip-adresser med hjälp av 0.0.0.0, bör du istället använda 127.0.0.1.

source: If your webhost set up Varnish for you, as is the case with DreamPress or WP Engine, you may need to ask them for the specifics if they don't have it documented. I've listed the ones I know about here, however you should still check with them if you're not sure.
sv_se: Om din webbhost har ställt in Varnish till dig (t.ex DreamPress eller Wp Engine) kan eventuellt nedanstående ip-adresser fungera.

source: If you aren't sure what to do, contact your webhost or server admin before making any changes.
sv_se: Om du är osäker på vad du bör göra, kontakta din webbhotells leverantör.

source: DreamHost - Go into the Panel and click on the DNS settings for the domain. The entry for <em>resolve-to.domain</em> (if set) will your varnish server. If it's not set, then you don't need to worry about this at all. Example:
sv_se: Dreamhost - Gå till panelen och klicka på DNS iställningarna för domänen. Raden <em>resolve-to.domain</em> indikerar vilken som är din Varnish server. Om det inte finns med i listan, kan du ignorera detta. Exempel:

source: The Varnish IP has been defined in your wp-config, so it is not editable here.
sv_se: Varnish IP har ställts in via wp-config. Du kan därför inte ställa in den här.

source: Example:
sv_se: Exempel:

source: While it would be impossible to detect all possible conflicts, this Status Page will perform a check of the most common issues that prevent Varnish from caching your site properly.
sv_se: Den här status sidan indikerar eventuella problem. Den är inte 100% sanningsenlig, men ger oftast en god indikation på vad som kan vara fel.

source: This request cannot be performed:
sv_se: Den här åtgärden kan inte genomföras:

source: This URL is a 404. Please check your typing and try again.
sv_se: Webbadressen returnerade 404. Vänligen kontrollera att adressen är korrekt och försök igen.

source: Results for %s
sv_se: Resultat för %s

source: Varnish is running properly and caching is happening.
sv_se: Varnish kör korrekt och cachar som planerat.

source: Varnish is running but cannot cache.
sv_se: Varnish kör men kan inte cacha något.

source: We did not find Varnish active for this domain.
sv_se: Vi kunde inte hitta någon aktiv Varnish installation för den hör domänen.

source: You have a Varnish IP set but a proxy like Cloudflare or Sucuri has not been detected. This is usually fine, but if you have issues with your cache not emptying when you make a post, you may need to <a href="%s">erase your Varnish IP</a>. Please check with your webhost or server admin before doing so.
sv_se: Du har Varnish inställt på en ip men en proxy så som Cloudflare eller Sucuri kan inte hittas. Det här är vanligtvis ok, men om du upplever problem kan du behöva <a href="%s">ta bort denna iställning</a>. Kontrollera med din leverantör innan du gör detta.

source: You're using a Custom Varnish IP that doesn't appear to match your server IP address. If you're using multiple Varnish servers or IPv6, this is fine. Please make sure you've <a href="%s">properly configured it</a> according to your webhost's specifications.
sv_se: Du har ställt in en Varnish ip som inte matchar din DNS inställning. Om du använder flera Varnish servrar eller IPv6, kan du ignorera detta meddelande. Vänligen kontrollera att allt är <a href="%s">inställt enligt instruktionerna</a> som finns hos din leverantör.

source: Your server IP setup looks good. If you are using a proxy (like Sucuri or Cloudflare or Fastly) please double check that configuration and make sure to add a <a href="%s">custom Varnish IP</a> if necessary.
sv_se: Din ip-konfiguration ser bra ut. Om du använder en proxy (Sucuri, Cloudflare eller Fastly) vänligen dubbelkolla att konfigurationen och se till att <a href="%s">Varnish IP</a> är inställt om det behövs.

source: Because CloudFlare is running, you may experience some cache oddities. Make sure you <a href="%s">configure WordPress for Cloudflare</a>.
sv_se: Eftersom Cloudflare används, kan vissa cacheproblem uppstå. Vänligen kontrollera att du har konfigurerat <a href="%s">WordPress för Cloudflare</a>.

source: You are running HHVM instead of PHP. Hip Hop!
sv_se: Du kör HHVM istället för PHP. Hip Hop!

source: Your site is compressing content and making the internet faster.
sv_se: Din webbplats komprimerar innehållet så att den blir snabbare.

source: <a href="%s">Fastly</a> is speeding up your site. Keep in mind, it may cache your CSS and images longer than Varnish does. Remember to empty all caches.
sv_se: <a href="%s">Fastly</a> används för att göra webbplatsen snabbare. Tänk på att detta plugin kanske har en längre cachetid än varnish. Kom ihåg att tömma alla dina cachefiler.

source: A plugin or theme is setting a PHPSESSID cookie on every pageload. This makes Varnish not deliver cached pages.
sv_se: Ett plugin sätter en PHPSESSID kaka vid varje sidladdning. Det gör att varnish inte kan leverera cache.

source: <a href="%s">Easy Digital Downloads</a> is being used with cookie sessions. This may cause your cache to misbehave. If you have issues, please set <code>define( "EDD_USE_PHP_SESSIONS", true );</code> in your <code>wp-config.php</code> file.
sv_se: <a href="%s">Easy Digital Downloads</a>använder sessioner. Det kan sätta Varnish ur spel. Om problem skulle uppstå definiera <code>define( "EDD_USE_PHP_SESSIONS", true );</code> i din <code>wp-config.php</code> fil.

source: <a href="%s">Easy Digital Downloads</a> is putting down a shopping cart cookie on every page load. Make sure Varnish is set up to ignore that when it's empty.
sv_se: <a href="%s">Easy Digital Downloads</a> skriver en kaka för varukorgen. Vänligen ställ in Varnish så att denna ignoreras om den är tom.

source: <a href="%s">Wordfence</a> is putting down cookies on every page load. Please disable that in your options (available from version 4.0.4 and up).
sv_se: <a href="%s">Wordfence</a> skickar en sessionskaka. Vänligen avaktivera detta i inställningarna (tillgängligt från och med version 4.0.4).

source: <a href="%s">Invite Anyone</a>, a plugin for BuddyPress, is putting down a cookie on every page load. This will prevent Varnish from caching.
sv_se: <a href="%s">Invite Anyone</a>, ett plugin för BuddyPress, skickar en sessionskaka. Det här kan påverka cachningen negativt.

source: Your domain does not report an "Age" header, which means we can't tell if the page is actually serving from cache.
sv_se: Din domän rapporterar ingen "Age" header, vilket innebär att vi inte kan klura ut om sidan skickas från Varnish cache.

source: The "Age" header is set to less than 1, which means you checked right when Varnish cleared the cache for that url or Varnish is not actually serving the content for that url from cache. Check again (refresh the page) but if it happens again, it could be one of the following reasons:
sv_se: Headern "Age" är mindre än 1, vilket innebär att du är den första som besöker sidan efter att cachen har tömts. Testa igen för att försäkra dig att någon inte är fel. Skulle det vara fallet kan felet bero på:

source: That url is excluded from the cache on purpose in the Varnish vcl file (in which case everything is working.)
sv_se: Den webbadressen är exkluderad från cachen i Varnish konfiguration.

source: A theme or plugin is sending cache headers that are telling Varnish not to serve that content from cache. This means you will have to fix the cache headers the application is sending to Varnish. A lot of the time those headers are Cache-Control and/or Expires.
sv_se: Ett tema eller plugin skickar en header som instruerar Varnish att inte skicka innehållet från cacheminnet. Det betyder att du måste fixa cacheheadern som sidan skickar till Varnish. Detta är ofta ett problem som orsakas av header Cache-Control och / eller Expires.

source: A theme or plugin is setting a session cookie, which can prevent Varnish from serving content from cache. You need to make it not send a session cookie for anonymous traffic.
sv_se: Ett plugin eller tema sätter en sessionskaka. Detta kan påverka Varnish förmåga att serva cachade sidor. Du bör filtrera bort denna session i inställningarna för Varnish.

source: Something is setting the header Cache-Control to "no-cache" which means visitors will never get cached pages.
sv_se: Något sätter header Cache-Control to "no-cache" vilket innebär att besökare aldrig kommer få en cachad version av sidan.

source: Something is setting the header Cache-Control to "max-age=0" which means a page can be no older than 0 seconds before it needs to regenerate the cache.
sv_se: Något ställer in headern Cache-Control till "max-age=0" vilket innebär att sidan inte får vara äldre än 0 sekunder förrän cachen måste genereras om.

source: Something is setting the header Pragma to "no-cache" which means visitors will never get cached pages.
sv_se: Något ställer in Pragma to "no-cache" vilket innebär att besökare inte kommer få cachade versioner av sidorna.

source: X-Cache missed, which means it was not able to serve this page as cached.
sv_se: X-Cache missades, vilket innebär att den inte kunde levereras i cachad version.

source: Mod Pagespeed is active and working properly with Varnish.
sv_se: Mod Pagespeed är aktiverat och fungerar korrekt.

source: Mod Pagespeed is active but it looks like your caching headers may not be right. This may be a false negative if other parts of your site are overwriting headers. Fix all other errors listed, then come back to this. If you are still having errors, you will need to look into using htaccess or nginx to override the Pagespeed headers.
sv_se: Mod Pagespeed är aktiverat, men det ser ut som att sidans headers inte är korrekta. Det här kan vara felaktigt om andra delar av din webbplats skriver över headers. Vänlige korrigera samtliga fel nedan och kör testet igen. Om problemen kvarstår behöver du kontrollera din htaccess eller nginx konfiguration.

source: Automatically empty pages cached by Varnish when content on your site is modified.
sv_se: Tömmer automatiskt sidor som har cachats med Varnish när innehållet uppdateras.
